Revit 2027 API
UIApplication.CreateRibbonTab Method
 Creates a new tab on the Revit user interface.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void CreateRibbonTab(
	string tabName
)
Public Overridable Sub CreateRibbonTab (
	tabName As String
)
public:
virtual void CreateRibbonTab(
	String^ tabName
)
abstract CreateRibbonTab :
        tabName : string -> unit
override CreateRibbonTab :
        tabName : string -> unit
Parameters
tabName String
The name of the tab to be created.
Exceptions
Exception | Condition
ArgumentNullException | tabName or panelName is null.
ArgumentException | tabName or panelName is Empty or the tab name duplicates the name of another tab in the Revit UI.
InvalidOperationException | Too many custom tabs have been created in this session. (Maximum is 20).
Remarks
 This method will create a custom tab at the end of the list of static tabs. If multiple tabs are added, they will be shown in the order added. This method is not supported in Macros.
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace